<a href="https://colab.research.google.com/github/ajay152603/Pierian-Data-Bootcamp/blob/master/Matplotlib%20-%20Data%20how%20you%20wanna%20look%20at%20it%20%23%20Python%20for%20data%20Visualization.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 3. Matplotlib - Data how you wanna look at it # Python for data Visualization

# Plotting

In [0]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [0]:
customer = pd.read_csv('/content/P6-UK-Bank-Customers.csv')

In [0]:
customer.head()

   Customer ID     Name  Surname  ... Job Classification  Date Joined    Balance
0    100000001    Simon    Walsh  ...       White Collar    05.Jan.15  113810.15
1    400000002  Jasmine   Miller  ...        Blue Collar    06.Jan.15   36919.73
2    100000003     Liam    Brown  ...       White Collar    07.Jan.15  101536.83
3    300000004   Trevor     Parr  ...       White Collar    08.Jan.15    1421.52
4    100000005  Deirdre  Pullman  ...        Blue Collar    09.Jan.15   35639.79

[5 rows x 9 columns]

In [0]:
#customer["Balance"].plot()

In [0]:
customer.info()
#customer.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4014 entries, 0 to 4013
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer ID         4014 non-null   int64
 1   Name                4014 non-null   object
 2   Surname             4014 non-null   object
 3   Gender              4014 non-null   object
 4   Age                 4014 non-null   int64
 5   Region              4014 non-null   object
 6   Job Classification  4014 non-null   object
 7   Date Joined         4014 non-null   object
 8   Balance             4014 non-null   float64
dtypes: float64(1), int64(2), object(6)
memory usage: 282.4+ KB

In [0]:
#customer.plot.bar(x="Customer ID",  y = "Balance" )

In [0]:
#customer.plot.box()

In [0]:
#customer.plot.scatter(x="Age",  y = "Balance")

# Some Statistics

In [0]:
customer['Age'].mean()

38.611111111111114

In [0]:
customer['Age'].median()

37.0

In [0]:
customer['Age'].mode()

0    34
dtype: int64

In [0]:
customer['Age'].max()

64

In [0]:
customer['Age'].min()

15

In [0]:
customer['Age'].std()

9.819120984901577

In [0]:
customer['Age'].var()

96.4151369161345

In [0]:
customer['Age'].skew()

0.344601642091925

# Combining overlapping data sets

In [0]:
df1 = pd.DataFrame({'A': [1., np.nan, 3., 5., np.nan],
                    'B': [np.nan, 2., 3., np.nan, 6.]})
df2 = pd.DataFrame({'A': [5., 2., 4., np.nan, 3., 7.],
                    'B': [np.nan, np.nan, 3., 4., 6., 8.]})

In [0]:
df1

     A    B
0  1.0  NaN
1  NaN  2.0
2  3.0  3.0
3  5.0  NaN
4  NaN  6.0

In [0]:
df2

     A    B
0  5.0  NaN
1  2.0  NaN
2  4.0  3.0
3  NaN  4.0
4  3.0  6.0
5  7.0  8.0

In [0]:
df1.combine_first(df2)

     A    B
0  1.0  NaN
1  2.0  2.0
2  3.0  3.0
3  5.0  4.0
4  3.0  6.0
5  7.0  8.0

combine_first() combines two DataFrame objects where missing values in one DataFrame are conditionally filled with like-labeled values from the other DataFrame.

In [0]:
def combiner(x,y):
    return np.where(pd.isna(x),y,x)

In [0]:
df1 = pd.DataFrame({'A': [1., 2., 3., 5., 6.],
                     'B': [1., np.nan, 3., 4., np.nan]})
df1

     A    B
0  1.0  1.0
1  2.0  NaN
2  3.0  3.0
3  5.0  4.0
4  6.0  NaN

In [0]:
df2 = pd.DataFrame({'A': [5., 2., 4., 2., 3.],
                     'B': [7., 3., 4., 6., 8.]})
df2

     A    B
0  5.0  7.0
1  2.0  3.0
2  4.0  4.0
3  2.0  6.0
4  3.0  8.0

In [0]:
combiner(df1,df2)

array([[1., 1.],
       [2., 3.],
       [3., 3.],
       [5., 4.],
       [6., 8.]])

In [0]:
df1.sum(axis= 1 , skipna= True)

0    2.0
1    2.0
2    6.0
3    9.0
4    6.0
dtype: float64

In [0]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['infantry', 'infantry', 'cavalry', 'cavalry', 'infantry', 'infantry', 'cavalry', 'cavalry','infantry', 'infantry', 'cavalry', 'cavalry'], 
      'experience': ['veteran', 'rookie', 'veteran', 'rookie', 'veteran', 'rookie', 'veteran', 'rookie','veteran', 'rookie', 'veteran', 'rookie'],
         'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
       'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
         'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

In [0]:
df = pd.DataFrame( raw_data, columns= ['regiment', 'company', 'experience','name','preTestScore'])
df

      regiment   company experience      name  preTestScore
0   Nighthawks  infantry    veteran    Miller             4
1   Nighthawks  infantry     rookie  Jacobson            24
2   Nighthawks   cavalry    veteran       Ali            31
3   Nighthawks   cavalry     rookie    Milner             2
4     Dragoons  infantry    veteran     Cooze             3
5     Dragoons  infantry     rookie     Jacon             4
6     Dragoons   cavalry    veteran    Ryaner            24
7     Dragoons   cavalry     rookie      Sone            31
8       Scouts  infantry    veteran     Sloan             2
9       Scouts  infantry     rookie     Piger             3
10      Scouts   cavalry    veteran     Riani             2
11      Scouts   cavalry     rookie       Ali             3

In [0]:
#Counting the number of observations by regiment and category
pd.crosstab(df.regiment,df.company, margins= True)

company     cavalry  infantry  All
regiment
Dragoons          2         2    4
Nighthawks        2         2    4
Scouts            2         2    4
All               6         6   12

Create a crosstab of the number of rookie and veteran cavalry and infantry soldiers per regiment

In [0]:
pd.crosstab([df.company, df.experience],df.regiment, margins= True )

regiment             Dragoons  Nighthawks  Scouts  All
company  experience
cavalry  rookie             1           1       1    3
         veteran            1           1       1    3
infantry rookie             1           1       1    3
         veteran            1           1       1    3
All                         4           4       4   12

get_dummies() This function is used to convert categorical variable into dummy variable (one-hot encoding)

In [0]:
list('Hello')

TypeError: ignored